import type {TextData} from "../types/api";

const textData:TextData[] = [
    {
        name: "观世音菩萨圣号",
        text: "南无观世音菩萨。",
    },
    {
        name:"观音心咒",
        text:"唵嘛呢叭弥吽。",
    },
    {
        name:"千手千眼无碍大悲心陀罗尼",
        text:"南无喝啰怛那哆啰夜耶。南无阿唎耶。婆卢羯帝烁钵啰耶。菩提萨埵婆耶。摩诃萨埵婆耶。摩诃迦卢尼迦耶。唵。萨皤啰罚曳。数怛那怛写。南无悉吉栗埵伊蒙阿唎耶。婆卢吉帝室佛啰楞驮婆。南无那啰谨墀。醯唎摩诃皤哆沙咩。萨婆阿他豆输朋。阿逝孕。萨婆萨哆那摩婆萨多。那摩婆伽。摩罚特豆。怛姪他。唵。阿婆卢醯。卢迦帝。迦罗帝。夷醯唎。摩诃菩提萨埵。萨婆萨婆。摩啰摩啰。摩醯摩醯唎驮孕。俱卢俱卢羯蒙。度卢度卢罚阇耶帝。摩诃罚阇耶帝。陀啰陀啰。地唎尼。室佛啰耶。遮啰遮啰。么么罚摩啰。穆帝隶。伊醯伊醯。室那室那。阿啰嘇佛啰舍利。罚娑罚嘇。佛啰舍耶。呼卢呼卢摩啰。呼卢呼卢醯利。娑啰娑啰。悉唎悉唎。苏嚧苏嚧。菩提夜菩提夜。菩驮夜菩驮夜。弥帝利夜。那啰谨墀。地利瑟尼那。婆夜摩那。娑婆诃。悉陀夜。娑婆诃。摩诃悉陀夜。娑婆诃。悉陀喻艺。室皤啰耶。娑婆诃。那啰谨墀。娑婆诃。摩啰那啰。娑婆诃。悉啰僧阿穆佉耶。娑婆诃。娑婆摩诃阿悉陀夜。娑婆诃。者吉啰阿悉陀夜。娑婆诃。波陀摩羯悉陀夜。娑婆诃。那啰谨墀皤伽啰耶。娑婆诃。摩婆利胜羯啰夜。娑婆诃。南无喝啰怛那哆啰夜耶。南无阿利耶。婆嚧吉帝。烁皤啰夜。娑婆诃。唵。悉殿都。漫多啰。跋陀耶。娑婆诃。",
    },
    {
        name:"般若菠萝蜜心经",
        text:"观自在菩萨。行深般若波罗蜜多时。照见五蕴皆空。度一切苦厄。舍利子。色不异空。空不异色。色即是空。空即是色。受想行识。亦复如是。舍利子。是诸法空相。不生不灭。不垢不净。不增不减。是故空中无色。无受想行识。无眼耳鼻舌身意。无色声香味触法。无眼界。乃至无意识界。无无明。亦无无明尽。乃至无老死。亦无老死尽。无苦集灭道。无智亦无得。以无所得故。菩提萨埵。依般若波罗蜜多故。心无罣碍。无罣碍故。无有恐怖。远离颠倒梦想。究竟涅槃。三世诸佛。依般若波罗蜜多故。得阿耨多罗三藐三菩提。故知般若波罗蜜多。是大神咒。是大明咒。是无上咒。是无等等咒。能除一切苦。真实不虚。故说般若波罗蜜多咒。即说咒曰。揭谛揭谛。波罗揭谛。波罗僧揭谛。菩提萨婆诃。摩诃般若波罗蜜多。摩诃般若波罗蜜多。摩诃般若波罗蜜多。" ,
    },
    {
        name:"如意宝轮王陀罗尼",
        text:"南无佛驮耶。南无达摩耶。南无僧伽耶。南无观自在菩萨摩诃萨。具大悲心者。怛姪他。唵。斫羯啰伐底。震多末尼。摩诃。钵蹬迷。噜噜噜噜。底瑟吒。篅啰阿羯利。沙夜吽。癹莎诃。唵。钵蹋摩。震多末尼。篅攞吽。唵跋喇陀。钵亶谜吽。"
    },
    {
        name:"消灾吉祥神咒",
        text:"曩谟三满哆。母驮喃。阿钵啰底。贺多舍。娑曩喃。怛姪他。唵。佉佉。佉呬。佉呬。吽吽。入嚩啰。入嚩啰。钵啰入嚩啰。钵啰入嚩啰。底瑟姹。底瑟姹。瑟致哩。瑟致哩。娑癹吒。娑癹吒。扇底迦。室哩曳。娑嚩诃。"
    },
    {
        name:"功德宝山神咒",
        text:"南无佛驮耶。南无达摩耶。南无僧伽耶。唵。悉帝护噜噜。悉都噜。只利波。吉利婆。悉达哩。布噜哩。娑嚩诃。"
    },
    {
        name:"准提神咒",
        text:"稽首皈依苏悉帝。头面顶礼七俱胝。我今称赞大准提。唯愿慈悲垂加护。南无飒哆喃。三藐三菩陀。俱胝喃。怛姪他。唵。折戾主戾。准提娑婆诃。"
    },
    {
        name:"圣无量寿决定光明王陀罗尼",
        text:"唵捺摩巴葛瓦帝。阿巴啰密沓。阿优哩阿纳。苏必你。实执沓。牒左啰宰也。怛塔哿达也。阿啰诃帝。三药三不达也。怛你也塔。唵。萨哩巴。桑斯葛哩。叭哩述沓。达啰马帝。哿哿捺。桑马兀哿帝。莎巴瓦。比述帝。马喝捺也。叭哩瓦哩娑喝。",
    },
    {
        name:"药师灌顶真言",
        text:"南谟薄伽伐帝。鞞杀社。窭噜薜琉璃。钵喇婆。喝啰阇也。怛他揭多也。阿啰喝帝。三藐三勃陀耶。怛姪他。唵。鞞杀逝。鞞杀逝鞞杀社。三没揭帝莎诃。"
    },
    {
        name:"观音灵感真言",
        text:"唵嘛呢叭弥吽。麻曷倪牙纳。积都特巴达。积特些纳。微达哩葛。萨而斡而塔。卜哩悉塔葛。纳补啰纳。纳卜哩。丢忒班纳。奈麻嚧吉。说啰耶莎诃。"
    },
    {
        name:"七佛灭罪真言",
        text:"离婆离婆帝。求诃求诃帝。陀罗尼帝。尼诃啰帝。毗黎你帝。摩诃伽帝真陵乾帝。莎婆诃。"
    },
    {
        name: "往生净土神咒",
        text: "南无阿弥多婆夜。哆他伽多夜。哆地夜他。阿弥利都婆毗。阿弥利哆。悉耽婆毗。阿弥唎哆。毗迦兰帝。阿弥唎哆。毗迦兰多。伽弥腻伽伽那。枳多迦利。娑婆诃。",
    },
    {
        name: "大吉祥天女咒",
        text: "南无佛陀。南无达摩。南无僧伽。南无室利。摩诃提鼻耶。怛你也他。波利富楼那。遮利三曼陀。达舍尼。摩诃毗诃罗伽帝。三曼陀。毗尼伽帝。摩诃迦利野。波祢。波啰。波祢。萨利嚩栗他。三曼陀。修钵犂帝。富隶那。阿利那。达摩帝。摩诃毗鼓毕帝。摩诃弥勒帝。娄簸僧祇帝。醯帝簁。僧祇醯帝。三曼陀。阿他阿少。婆罗尼。",
    },
    {
        name: "解结咒",
        text: "唵。齿令金匝金匝胜金匝。我今为汝解金匝。终不为汝结金匝。唵。祥中祥。吉中吉。波罗会上有珠琍。一切冤家化吉祥。摩诃般若般罗密。",
    },
    {
        name:"礼佛大忏悔文",
        text:"大慈大悲愍众生，大喜大舍济含识；相好光明以自严，众等至心归命礼。\n" +
            "南无皈依金刚上师。\n" +
            "皈依佛，皈依法，皈依僧。\n" +
            "我今发心：不为自求人天福报、声闻、缘觉，乃至权乘诸位菩萨；唯依最上乘，发菩提心，愿与法界众生，一时同得阿耨多罗三藐三菩提。\n" +
            "南无皈依十方尽虚空界一切诸佛。\n" +
            "南无皈依十方尽虚空界一切尊法。\n" +
            "南无皈依十方尽虚空界一切贤圣僧。\n" +
            "南无如来、应供、正徧知、明行足、善逝、世间解、无上士、调御丈夫、天人师、佛、世尊。\n" +
            "南无普光佛\n" +
            "南无普明佛\n" +
            "南无普净佛\n" +
            "南无多摩罗跋栴檀香佛\n" +
            "南无栴檀光佛\n" +
            "南无摩尼幢佛\n" +
            "南无欢喜藏摩尼宝积佛\n" +
            "南无一切世间乐见上大精进佛\n" +
            "南无摩尼幢灯光佛\n" +
            "南无慧炬照佛\n" +
            "南无海德光明佛\n" +
            "南无金刚牢强普散金光佛\n" +
            "南无大强精进勇猛佛\n" +
            "南无大悲光佛\n" +
            "南无慈力王佛\n" +
            "南无慈藏佛\n" +
            "南无栴檀窟庄严胜佛\n" +
            "南无贤善首佛\n" +
            "南无善意佛\n" +
            "南无广庄严王佛\n" +
            "南无金华光佛\n" +
            "南无宝盖照空自在力王佛\n" +
            "南无虚空宝华光佛\n" +
            "南无琉璃庄严王佛\n" +
            "南无普现色身光佛\n" +
            "南无不动智光佛\n" +
            "南无降伏众魔王佛\n" +
            "南无才光明佛\n" +
            "南无智慧胜佛\n" +
            "南无弥勒仙光佛\n" +
            "南无善寂月音妙尊智王佛\n" +
            "南无世净光佛\n" +
            "南无龙种上尊王佛\n" +
            "南无日月光佛\n" +
            "南无日月珠光佛\n" +
            "南无慧幢胜王佛\n" +
            "南无师子吼自在力王佛\n" +
            "南无妙音胜佛\n" +
            "南无常光幢佛\n" +
            "南无观世灯佛\n" +
            "南无慧威灯王佛\n" +
            "南无法胜王佛\n" +
            "南无须弥光佛\n" +
            "南无须曼那华光佛\n" +
            "南无优昙钵罗华殊胜王佛\n" +
            "南无大慧力王佛\n" +
            "南无阿閦毗欢喜光佛\n" +
            "南无无量音声王佛\n" +
            "南无才光佛\n" +
            "南无金海光佛\n" +
            "南无山海慧自在通王佛\n" +
            "南无大通光佛\n" +
            "南无一切法常满王佛\n" +
            "南无释迦牟尼佛\n" +
            "南无金刚不坏佛\n" +
            "南无宝光佛\n" +
            "南无龙尊王佛\n" +
            "南无精进军佛\n" +
            "南无精进喜佛\n" +
            "南无宝火佛\n" +
            "南无宝月光佛\n" +
            "南无现无愚佛\n" +
            "南无宝月佛\n" +
            "南无无垢佛\n" +
            "南无离垢佛\n" +
            "南无勇施佛\n" +
            "南无清净佛\n" +
            "南无清净施佛\n" +
            "南无娑留那佛\n" +
            "南无水天佛\n" +
            "南无坚德佛\n" +
            "南无栴檀功德佛\n" +
            "南无无量掬光佛\n" +
            "南无光德佛\n" +
            "南无无忧德佛\n" +
            "南无那罗延佛\n" +
            "南无功德华佛\n" +
            "南无莲华光游戏神通佛\n" +
            "南无财功德佛\n" +
            "南无德念佛\n" +
            "南无善名称功德佛\n" +
            "南无红焰帝幢王佛\n" +
            "南无善游步功德佛\n" +
            "南无斗战胜佛\n" +
            "南无善游步佛\n" +
            "南无周匝庄严功德佛\n" +
            "南无宝华游步佛\n" +
            "南无宝莲华善住娑罗树王佛\n" +
            "南无法界藏身阿弥陀佛\n" +
            "如是等一切世界，诸佛世尊，常住在世。是诸世尊，当慈念我：若我此生，若我前生，从无始生死以来，所作众罪，若自作，若教他作，见作随喜；若塔，若僧，若四方僧物，若自取，若教他取，见取随喜；五无间罪，若自作，若教他作，见作随喜；十不善道，若自作，若教他作，见作随喜。所作罪障，或有覆藏，或不覆藏，应堕地狱、饿鬼、畜生，诸余恶趣、边地下贱，及篾戾车，如是等处，所作罪障，今皆忏悔。今诸佛世尊，当证知我，当忆念我。我复于诸佛世尊前，作如是言：若我此生，若我余生，曾行布施，或守净戒，乃至施与畜生，一抟之食；或修净行，所有善根；成就众生，所有善根；修行菩提，所有善根；及无上智，所有善根。一切合集，校计筹量，皆悉回向，阿耨多罗三藐三菩提。如过去、未来、现在诸佛，所作回向，我亦如是回向。众罪皆忏悔，诸福尽随喜；及请佛功德，愿成无上智。去、来、现在佛，于众生最胜。无量功德海，我今皈命礼。\n" +
            "所有十方世界中,三世一切人师子。我以清净身语意，一切徧礼尽无余。普贤行愿威神力，普现一切如来前。一身复现刹尘身，一一徧礼刹尘佛.\n" +
            "于一尘中尘数佛，各处菩萨众会中。无尽法界尘亦然，深信诸佛皆充满。各以一切音声海，普出无尽妙言辞。尽于未来一切劫，赞佛甚深功德海。\n" +
            "以诸最胜妙华鬘，伎乐涂香及伞盖。如是最胜庄严具，我以供养诸如来。最胜衣服最胜香，末香烧香与灯烛。一一皆如妙高聚，我悉供养诸如来。我以广大胜解心，深信一切三世佛。悉以普贤行愿力，普徧供养诸如来。\n" +
            "我昔所造诸恶业，皆由无始贪瞋痴。从身语意之所生，一切我今皆忏悔。\n" +
            "十方一切诸众生，二乘有学及无学。一切如来与菩萨，所有功德皆随喜。\n" +
            "十方所有世间灯，最初成就菩提者。我今一切皆劝请，转于无上妙法轮。\n" +
            "诸佛若欲示涅槃，我悉至诚而劝请。唯愿久住刹尘劫，利乐一切诸众生。\n" +
            "所有礼赞供养福，请佛住世转法轮。随喜忏悔诸善根，回向众生及佛道。\n" +
            "愿将以此胜功德，回向无上真法界。性相佛法及僧伽，二谛融通三昧印。如是无量功德海，我今皆悉尽回向。所有众生身口意，见惑弹谤我法等。如是一切诸业障，悉皆消灭尽无余。念念智周于法界，广度众生皆不退。乃至虚空世界尽，众生及业烦恼尽。如是四法广无边，愿今回向亦如是。\n" +
            "南无大行普贤菩萨。南无大行普贤菩萨。南无大行普贤菩萨。\n"
    },
    {
        name: "补阙真言",
        text: "南谟喝啰怛那。哆啰夜耶。佉啰佉啰。俱住俱住。摩啰摩啰。虎啰。吽。贺贺。苏怛拏。吽。泼抹拏。娑婆诃。",
    },
    {
        name:"净口业真言",
        text:"唵。修唎修唎。摩诃修唎。修修唎。萨婆诃。"
    }
]

export default  textData;